tooling/artillery/scenarios/test-get-v1.yml
config:
  plugins:
    publish-metrics:
      - type: influxdb-statsd
        prefix: artillery.get-v1.
        host: 127.0.0.1
        port: 8125
    expect: {}
  target: 'http://localhost:8092/api/'
  phases:
    - duration: 10
      arrivalRate: 5
    - duration: 20
      arrivalRate: 5
      rampTo: 15
    - duration: 30
      arrivalRate: 15
    - duration: 20
      arrivalRate: 30
    - duration: 30
      arrivalRate: 15
    - duration: 20
      arrivalRate: 30
    - duration: 10
      arrivalRate: 15
    - duration: 20
      arrivalRate: 15
      rampTo: 5
    - duration: 10
      arrivalRate: 5
scenarios:
  - name: "GET for /v1/example"
    flow:
    - get:
        url: "/v1/example"
        capture:
          - json: "$.status"
            as: status
        expect:
          - statusCode: 200
          - equals:
            - "success"
            - "{{status}}"