tooling/artillery/scenarios/test-scenario-5.yaml
config:
  http:
    pool: 1000
  plugins:
    publish-metrics:
      - type: influxdb-statsd
        prefix: artillery.scenario-5.
        host: 127.0.0.1
        port: 8125
    expect: {}
  target: 'http://localhost:8092/'
  phases:
    - duration: 10
      arrivalRate: 10
scenarios:
  - flow:
    - get:
        url: "/scenario5/100-small-snippets-1-service-wtih-big-json.html"
        expect:
          - statusCode: 200