tooling/artillery/scenarios/test-soak-example.yaml
config:
  http:
    pool: 1000
  plugins:
    publish-metrics:
      - type: influxdb-statsd
        prefix: artillery.
        host: 127.0.0.1
        port: 8125
    expect: {}
  target: 'http://localhost:8092/api/'
  processor: "./my-functions.js"
  phases:
    - duration: 10
      arrivalRate: 1
scenarios:
  - name: "simple-1snippet-1service"
    weight: 40
    flow:
      - post:
          url: "/v1/example"
          headers:
            Content-Type: text/html
          beforeRequest: "setBodyForSimple1Snippet1Service"
  - name: "simple-1snippet-5service"
    weight: 25
    flow:
      - post:
          url: "/v1/example"
          headers:
            Content-Type: text/html
          beforeRequest: "setBodyForSimple1Snippet5Service"
  - name: "simple-5snippets"
    weight: 25
    flow:
      - post:
          url: "/v1/example"
          headers:
            Content-Type: text/html
          beforeRequest: "setBodyForSimple5Snippets"
  - name: "simple-big-data"
    weight: 5
    flow:
      - post:
          url: "/v1/example"
          headers:
            Content-Type: text/html
          beforeRequest: "setBodyForSimpleBigData"
  - name: "1-big-snippet-1-service-with-big-json"
    weight: 5
    flow:
      - post:
          url: "/v1/example"
          headers:
            Content-Type: text/html
          beforeRequest: "setBodyFor1BigSnippet1ServiceWithBigJson"